---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet.ForwardIterator
source: html/3b49b235-96f1-7215-004f-f0b779ba1571.htm
---
# Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet.ForwardIterator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual MEPBuildingConstructionSetIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the set.